#include "Passport.h"

void main()
{
	setlocale(LC_ALL, "Rus");
	Passport* a = new Passport("Клюкин", "Константин", "Владимирович", Date(1, 20, 1996), " г.Алматы Алматинская обл.ул.Навои 310 ",
		"г.Темиртау Карагандинская обл. ул.Металлургов 21/2б");
	a->Print();
	Passport* b = new Passport("Рукин", "Евгений", "Валентинович", { 3, 13, 1977 }, "г.Астана Акмолинская обл.ул.Назарбаева 12",
		"г.Павлодар Карагандиская обл. ул.Нигматулина 1/4");
	b->Print();

	cout << "------------------------------------------\n\n";

	ForeignPassport* c = new ForeignPassport("Клюкин", "Константин", "Владимирович", Date(1, 20, 1996), " г.Алматы Алматинская обл.ул.Навои 310 ",
		"г.Темиртау Карагандинская обл. ул.Металлургов 21/2б", "русский", "муж.", 22);
	c->Print();
	ForeignPassport* d = new ForeignPassport("Рукин", "Евгений", "Валентинович", { 3, 13, 1977 }, "г.Астана Акмолинская обл.ул.Назарбаева 12",
		"г.Павлодар Карагандиская обл. ул.Нигматулина 1/4", "украинец", "муж.", 41);
	d->Print();
	system("pause");
}